Revit 2027 API
ViewSchedule.UseStripedRowsOnSheets Property
 Indicates whether a property setting of true will also change the display of this schedule to show striped rows on a sheet. If true, setting that property to true will also change the display. If false, striped rows will not display for this schedule on a sheet no matter what value is set for HasStripedRows.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseStripedRowsOnSheets { get; set; }
Public Property UseStripedRowsOnSheets As Boolean
	Get
	Set
public:
property bool UseStripedRowsOnSheets {
	bool get ();
	void set (bool value);
}
member UseStripedRowsOnSheets : bool with get, set
Property Value
Boolean
Remarks
 Striped rows on sheets can be overidden by shading or conditional formatting.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace